src/cf/Catalogs/sms4bШаблоны.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>sms4bШаблоны</Name>
			<Comment>Шаблоны заполнения содержания сообщений SMS</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Comment>Содержание шаблона</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_ШаблонОповещения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/CRM_НазначенияАвтотекста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Enum>
		<Properties>
			<Name>CRM_НазначенияАвтотекста</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТегШаблона</Name>
					<Comment>Тег шаблона печати в Microsoft Word и OpenOffice.org Writer</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТегШаблонаЗначениеКолонки</Name>
					<Comment>Тег шаблона печати в Microsoft Word и OpenOffice.org Writer (значение колонки)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтотекстЭлектронноеПисьмо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтотекстСМССообщение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтотекстЗадачаИсполнителя</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/sms4bШаблоны/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
// +CRM
	Если Объект.Ссылка.Пустая() Тогда
		Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			Объект.CRM_ШаблонОповещения = Параметры.ЗначениеКопирования.CRM_ШаблонОповещения;
		Иначе
			Если Параметры.Свойство("ШаблонОповещения") Тогда
				Объект.CRM_ШаблонОповещения = Параметры.ШаблонОповещения;
			Иначе
				Объект.CRM_ШаблонОповещения = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
// -CRM
	ТаблицаАвтотекстаЗнач = РеквизитФормыВЗначение("ТаблицаАвтотекста");
	CRM_АвтотекстПереопределяемый.СформироватьСписокАвтотекста(ТаблицаАвтотекстаЗнач, Перечисления.CRM_НазначенияАвтотекста.АвтотекстСМССообщение);
	НачальныйНомер = ТаблицаАвтотекстаЗнач.Количество();
	Если Объект.CRM_ШаблонОповещения Тогда
		CRM_АвтотекстПереопределяемый.СформироватьСписокАвтотекста(ТаблицаАвтотекстаЗнач, Перечисления.CRM_НазначенияАвтотекста.АвтотекстЗадачаИсполнителя,,,НачальныйНомер);
	КонецЕсли;
	ЗначениеВРеквизитФормы(ТаблицаАвтотекстаЗнач, "ТаблицаАвтотекста");
	
	CRM_АвтотекстПереопределяемый.ЗаполнитьКоманднуюПанельСообщенияСМС(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВставитьТэгСМС(Команда)
	
	ИмяКоманды = СтрЗаменить(Команда.Имя,"_СМС","");
	
	МассивСтрок = ТаблицаАвтотекста.НайтиСтроки(Новый Структура("ИмяКоманды",ИмяКоманды));
	Тэг = МассивСтрок[0].Тэг;
	Объект.Содержание = Объект.Содержание + " " + Тэг;
	
КонецПроцедуры
